zephyrproject-rtos/zephyr/drivers/pinmux/stm32/pinmux_stm32g4x.h
/*
 * Copyright (c) 2019 Richard Osterloh <richard.osterloh@gmail.com>
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_DRIVERS_PINMUX_STM32_PINMUX_STM32G4X_H_
#define ZEPHYR_DRIVERS_PINMUX_STM32_PINMUX_STM32G4X_H_

/**
 * @file Header for STM32G4X pin multiplexing helper
 */

/* Port A */
#define STM32G4X_PINMUX_FUNC_PA0_PWM2_CH1 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_1 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PA0_USART2_CTS __DEPRECATED_MACRO                                    \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_OPENDRAIN_PULLUP)
#define STM32G4X_PINMUX_FUNC_PA0_ADC12_IN1 STM32_MODER_ANALOG_MODE

#define STM32G4X_PINMUX_FUNC_PA1_PWM2_CH2 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_1 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PA1_USART2_RTS __DEPRECATED_MACRO                                    \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_OPENDRAIN_PULLUP)
#define STM32G4X_PINMUX_FUNC_PA1_ADC12_IN2 STM32_MODER_ANALOG_MODE

#define STM32G4X_PINMUX_FUNC_PA2_PWM2_CH3 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_1 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PA2_USART2_TX __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUSHPULL_PULLUP)
#define STM32G4X_PINMUX_FUNC_PA2_LPUART1_TX __DEPRECATED_MACRO                                    \
	(STM32_PINMUX_ALT_FUNC_12 | STM32_PUSHPULL_PULLUP)
#define STM32G4X_PINMUX_FUNC_PA2_ADC1_IN3 STM32_MODER_ANALOG_MODE

#define STM32G4X_PINMUX_FUNC_PA3_PWM2_CH4 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_1 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PA3_USART2_RX __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUPDR_NO_PULL)
#define STM32G4X_PINMUX_FUNC_PA3_LPUART1_RX __DEPRECATED_MACRO                                    \
	(STM32_PINMUX_ALT_FUNC_12 | STM32_PUPDR_NO_PULL)
#define STM32G4X_PINMUX_FUNC_PA3_ADC1_IN4 STM32_MODER_ANALOG_MODE

#define STM32G4X_PINMUX_FUNC_PA4_PWM3_CH2 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PA4_SPI1_NSS                                      \
	(STM32_PINMUX_ALT_FUNC_5 | STM32_PUSHPULL_PULLUP)
#define STM32G4X_PINMUX_FUNC_PA4_ADC2_IN17 STM32_MODER_ANALOG_MODE
#define STM32G4X_PINMUX_FUNC_PA4_DAC1_OUT1 __DEPRECATED_MACRO STM32_MODER_ANALOG_MODE

#define STM32G4X_PINMUX_FUNC_PA5_PWM2_CH1 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_1 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PA5_SPI1_SCK                                      \
	(STM32_PINMUX_ALT_FUNC_5 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PA5_ADC2_IN13 STM32_MODER_ANALOG_MODE
#define STM32G4X_PINMUX_FUNC_PA5_DAC1_OUT2 __DEPRECATED_MACRO STM32_MODER_ANALOG_MODE

#define STM32G4X_PINMUX_FUNC_PA6_PWM3_CH1 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PA6_SPI1_MISO                                     \
	(STM32_PINMUX_ALT_FUNC_5 | STM32_PUPDR_PULL_DOWN)
#define STM32G4X_PINMUX_FUNC_PA6_LPUART1_CTS __DEPRECATED_MACRO                                   \
	(STM32_PINMUX_ALT_FUNC_12 | STM32_OPENDRAIN_PULLUP)
#define STM32G4X_PINMUX_FUNC_PA6_ADC2_IN3 STM32_MODER_ANALOG_MODE
#define STM32G4X_PINMUX_FUNC_PA6_DAC2_OUT1 __DEPRECATED_MACRO STM32_MODER_ANALOG_MODE

#define STM32G4X_PINMUX_FUNC_PA7_PWM3_CH2 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PA7_SPI1_MOSI                                     \
	(STM32_PINMUX_ALT_FUNC_5 | STM32_PUPDR_PULL_DOWN)
#define STM32G4X_PINMUX_FUNC_PA7_ADC2_IN4 STM32_MODER_ANALOG_MODE

#define STM32G4X_PINMUX_FUNC_PA8_I2C3_SCL                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_OPENDRAIN_PULLUP)
#define STM32G4X_PINMUX_FUNC_PA8_I2C2_SDA                                      \
	(STM32_PINMUX_ALT_FUNC_4 | STM32_OPENDRAIN_PULLUP)
#define STM32G4X_PINMUX_FUNC_PA8_PWM1_CH1 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_6 | STM32_PUSHPULL_NOPULL)

#define STM32G4X_PINMUX_FUNC_PA9_I2C2_SCL                                      \
	(STM32_PINMUX_ALT_FUNC_4 | STM32_OPENDRAIN_PULLUP)
#define STM32G4X_PINMUX_FUNC_PA9_PWM1_CH2 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_6 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PA9_USART1_TX __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUSHPULL_PULLUP)
#define STM32G4X_PINMUX_FUNC_PA9_PWM2_CH3 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_10 | STM32_PUSHPULL_NOPULL)

#define STM32G4X_PINMUX_FUNC_PA10_SPI2_MISO                                    \
	(STM32_PINMUX_ALT_FUNC_5 | STM32_PUPDR_PULL_DOWN)
#define STM32G4X_PINMUX_FUNC_PA10_PWM1_CH3 __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_6 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PA10_USART1_RX __DEPRECATED_MACRO                                    \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUPDR_NO_PULL)
#define STM32G4X_PINMUX_FUNC_PA10_PWM2_CH4 __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_10 | STM32_PUSHPULL_NOPULL)

#define STM32G4X_PINMUX_FUNC_PA11_SPI2_MOSI                                    \
	(STM32_PINMUX_ALT_FUNC_5 | STM32_PUPDR_PULL_DOWN)
#define STM32G4X_PINMUX_FUNC_PA11_USART1_CTS __DEPRECATED_MACRO                                   \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_OPENDRAIN_PULLUP)
#define STM32G4X_PINMUX_FUNC_PA11_FDCAN1_RX                                    \
	(STM32_PINMUX_ALT_FUNC_9 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PA11_PWM4_CH1 __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_10 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PA11_PWM1_CH4 __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_11 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PA11_USB_DM STM32_PUSHPULL_NOPULL

