zephyrproject-rtos/zephyr/drivers/pinmux/stm32/pinmux_stm32g4x.h
#define STM32G4X_PINMUX_FUNC_PA12_USART1_RTS __DEPRECATED_MACRO                                   \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_OPENDRAIN_PULLUP)
#define STM32G4X_PINMUX_FUNC_PA12_FDCAN1_TX                                    \
	(STM32_PINMUX_ALT_FUNC_9 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PA12_PWM4_CH2 __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_10 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PA12_USB_DP STM32_PUSHPULL_NOPULL

#define STM32G4X_PINMUX_FUNC_PA13_I2C1_SCL                                     \
	(STM32_PINMUX_ALT_FUNC_4 | STM32_OPENDRAIN_PULLUP)
#define STM32G4X_PINMUX_FUNC_PA13_USART3_CTS __DEPRECATED_MACRO                                   \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_OPENDRAIN_PULLUP)
#define STM32G4X_PINMUX_FUNC_PA13_PWM4_CH3 __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_10 | STM32_PUSHPULL_NOPULL)

#define STM32G4X_PINMUX_FUNC_PA14_I2C1_SDA                                     \
	(STM32_PINMUX_ALT_FUNC_4 | STM32_OPENDRAIN_PULLUP)
#define STM32G4X_PINMUX_FUNC_PA14_PWM8_CH2 __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_5 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PA14_USART2_TX __DEPRECATED_MACRO                                    \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUSHPULL_PULLUP)

#define STM32G4X_PINMUX_FUNC_PA15_PWM2_CH1 __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_1 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PA15_PWM8_CH1 __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PA15_I2C1_SCL                                     \
	(STM32_PINMUX_ALT_FUNC_4 | STM32_OPENDRAIN_PULLUP)
#define STM32G4X_PINMUX_FUNC_PA15_SPI1_NSS                                     \
	(STM32_PINMUX_ALT_FUNC_5 | STM32_PUSHPULL_PULLUP)
#define STM32G4X_PINMUX_FUNC_PA15_SPI3_NSS                                     \
	(STM32_PINMUX_ALT_FUNC_6 | STM32_PUSHPULL_PULLUP)
#define STM32G4X_PINMUX_FUNC_PA15_USART2_RX __DEPRECATED_MACRO                                    \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUPDR_NO_PULL)
#define STM32G4X_PINMUX_FUNC_PA15_UART4_RTS __DEPRECATED_MACRO                                    \
	(STM32_PINMUX_ALT_FUNC_8 | STM32_OPENDRAIN_PULLUP)

/* Port B */
#define STM32G4X_PINMUX_FUNC_PB0_PWM3_CH3 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PB0_ADC1_IN15 STM32_MODER_ANALOG_MODE

#define STM32G4X_PINMUX_FUNC_PB1_PWM3_CH4 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PB1_LPUART1_RTS __DEPRECATED_MACRO                                   \
	(STM32_PINMUX_ALT_FUNC_12 | STM32_OPENDRAIN_PULLUP)
#define STM32G4X_PINMUX_FUNC_PB1_ADC1_IN12 STM32_MODER_ANALOG_MODE

#define STM32G4X_PINMUX_FUNC_PB3_PWM2_CH2 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_1 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PB3_SPI1_SCK                                      \
	(STM32_PINMUX_ALT_FUNC_5 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PB3_SPI3_SCK                                      \
	(STM32_PINMUX_ALT_FUNC_6 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PB3_USART2_TX __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUSHPULL_PULLUP)

#define STM32G4X_PINMUX_FUNC_PB4_PWM3_CH1 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PB4_SPI1_MISO                                     \
	(STM32_PINMUX_ALT_FUNC_5 | STM32_PUPDR_PULL_DOWN)
#define STM32G4X_PINMUX_FUNC_PB4_SPI3_MISO                                     \
	(STM32_PINMUX_ALT_FUNC_6 | STM32_PUPDR_PULL_DOWN)
#define STM32G4X_PINMUX_FUNC_PB4_USART2_RX __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUPDR_NO_PULL)

#define STM32G4X_PINMUX_FUNC_PB5_PWM3_CH2 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PB5_SPI1_MOSI                                     \
	(STM32_PINMUX_ALT_FUNC_5 | STM32_PUPDR_PULL_DOWN)
#define STM32G4X_PINMUX_FUNC_PB5_SPI3_MOSI                                     \
	(STM32_PINMUX_ALT_FUNC_6 | STM32_PUPDR_PULL_DOWN)
#define STM32G4X_PINMUX_FUNC_PB5_I2C3_SDA                                      \
	(STM32_PINMUX_ALT_FUNC_8 | STM32_OPENDRAIN_PULLUP)

#define STM32G4X_PINMUX_FUNC_PB6_PWM4_CH1 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PB6_PWM8_CH1 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_5 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PB6_USART1_TX __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUSHPULL_PULLUP)

#define STM32G4X_PINMUX_FUNC_PB7_PWM4_CH2 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PB7_I2C1_SDA                                      \
	(STM32_PINMUX_ALT_FUNC_4 | STM32_OPENDRAIN_PULLUP)
#define STM32G4X_PINMUX_FUNC_PB7_USART1_RX __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUPDR_NO_PULL)
#define STM32G4X_PINMUX_FUNC_PB7_PWM3_CH4 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_10 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PB7_UART4_CTS __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_14 | STM32_OPENDRAIN_PULLUP)

#define STM32G4X_PINMUX_FUNC_PB8_PWM4_CH3 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PB8_I2C1_SCL                                      \
	(STM32_PINMUX_ALT_FUNC_4 | STM32_OPENDRAIN_PULLUP)
#define STM32G4X_PINMUX_FUNC_PB8_USART3_RX __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUPDR_NO_PULL)
#define STM32G4X_PINMUX_FUNC_PB8_FDCAN1_RX                                     \
	(STM32_PINMUX_ALT_FUNC_9 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PB8_PWM8_CH2 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_10 | STM32_PUSHPULL_NOPULL)

#define STM32G4X_PINMUX_FUNC_PB9_PWM4_CH4 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PB9_I2C1_SDA                                      \
	(STM32_PINMUX_ALT_FUNC_4 | STM32_OPENDRAIN_PULLUP)
#define STM32G4X_PINMUX_FUNC_PB9_USART3_TX __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUSHPULL_PULLUP)
#define STM32G4X_PINMUX_FUNC_PB9_FDCAN1_TX                                     \
	(STM32_PINMUX_ALT_FUNC_9 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PB9_PWM8_CH3 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_10 | STM32_PUSHPULL_NOPULL)

#define STM32G4X_PINMUX_FUNC_PB10_PWM2_CH3 __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_1 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PB10_USART3_TX __DEPRECATED_MACRO                                    \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUSHPULL_PULLUP)
#define STM32G4X_PINMUX_FUNC_PB10_LPUART1_RX __DEPRECATED_MACRO                                   \
	(STM32_PINMUX_ALT_FUNC_8 | STM32_PUPDR_NO_PULL)

#define STM32G4X_PINMUX_FUNC_PB11_PWM2_CH4 __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_1 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PB11_USART3_RX __DEPRECATED_MACRO                                    \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUPDR_NO_PULL)
#define STM32G4X_PINMUX_FUNC_PB11_LPUART1_TX __DEPRECATED_MACRO                                   \
	(STM32_PINMUX_ALT_FUNC_8 | STM32_PUSHPULL_PULLUP)
#define STM32G4X_PINMUX_FUNC_PB11_ADC12_IN14 STM32_MODER_ANALOG_MODE

#define STM32G4X_PINMUX_FUNC_PB12_SPI2_NSS                                     \
	(STM32_PINMUX_ALT_FUNC_5 | STM32_PUSHPULL_PULLUP)
#define STM32G4X_PINMUX_FUNC_PB12_LPUART1_RTS __DEPRECATED_MACRO                                  \
	(STM32_PINMUX_ALT_FUNC_8 | STM32_OPENDRAIN_PULLUP)
#define STM32G4X_PINMUX_FUNC_PB12_ADC1_IN11 STM32_MODER_ANALOG_MODE

#define STM32G4X_PINMUX_FUNC_PB13_SPI2_SCK                                     \
	(STM32_PINMUX_ALT_FUNC_5 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PB13_USART3_CTS __DEPRECATED_MACRO                                   \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_OPENDRAIN_PULLUP)
#define STM32G4X_PINMUX_FUNC_PB13_LPUART1_CTS __DEPRECATED_MACRO                                  \
	(STM32_PINMUX_ALT_FUNC_8 | STM32_OPENDRAIN_PULLUP)

#define STM32G4X_PINMUX_FUNC_PB14_PWM15_CH1 __DEPRECATED_MACRO                                    \
	(STM32_PINMUX_ALT_FUNC_1 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PB14_SPI2_MISO                                    \
	(STM32_PINMUX_ALT_FUNC_5 | STM32_PUPDR_PULL_DOWN)
#define STM32G4X_PINMUX_FUNC_PB14_USART3_RTS __DEPRECATED_MACRO                                   \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_OPENDRAIN_PULLUP)
#define STM32G4X_PINMUX_FUNC_PB14_ADC1_IN5 STM32_MODER_ANALOG_MODE

#define STM32G4X_PINMUX_FUNC_PB15_PWM15_CH2 __DEPRECATED_MACRO                                    \
	(STM32_PINMUX_ALT_FUNC_1 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PB15_SPI2_MOSI                                    \
	(STM32_PINMUX_ALT_FUNC_5 | STM32_PUPDR_PULL_DOWN)
#define STM32G4X_PINMUX_FUNC_PB15_ADC2_IN15 STM32_MODER_ANALOG_MODE

/* Port C */
#define STM32G4X_PINMUX_FUNC_PC0_PWM1_CH1 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PC0_LPUART1_RX __DEPRECATED_MACRO                                    \
	(STM32_PINMUX_ALT_FUNC_8 | STM32_PUPDR_NO_PULL)
#define STM32G4X_PINMUX_FUNC_PC0_ADC12_IN6 STM32_MODER_ANALOG_MODE

#define STM32G4X_PINMUX_FUNC_PC1_PWM1_CH2 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PC1_LPUART1_TX __DEPRECATED_MACRO                                    \
	(STM32_PINMUX_ALT_FUNC_8 | STM32_PUSHPULL_PULLUP)
#define STM32G4X_PINMUX_FUNC_PC1_ADC12_IN7 STM32_MODER_ANALOG_MODE

