zephyrproject-rtos/zephyr/drivers/pinmux/stm32/pinmux_stm32g4x.h
#define STM32G4X_PINMUX_FUNC_PC2_PWM1_CH3 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PC2_ADC12_IN8 STM32_MODER_ANALOG_MODE

#define STM32G4X_PINMUX_FUNC_PC3_PWM1_CH4 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PC3_ADC12_IN9 STM32_MODER_ANALOG_MODE

#define STM32G4X_PINMUX_FUNC_PC4_I2C2_SCL                                      \
	(STM32_PINMUX_ALT_FUNC_4 | STM32_OPENDRAIN_PULLUP)
#define STM32G4X_PINMUX_FUNC_PC4_USART1_TX __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUSHPULL_PULLUP)
#define STM32G4X_PINMUX_FUNC_PC4_ADC2_IN5 STM32_MODER_ANALOG_MODE

#define STM32G4X_PINMUX_FUNC_PC5_USART1_RX __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUPDR_NO_PULL)
#define STM32G4X_PINMUX_FUNC_PC5_ADC2_IN11 STM32_MODER_ANALOG_MODE

#define STM32G4X_PINMUX_FUNC_PC6_PWM3_CH1 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PC6_PWM8_CH1 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_4 | STM32_PUSHPULL_NOPULL)

#define STM32G4X_PINMUX_FUNC_PC7_PWM3_CH2 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PC7_PWM8_CH2 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_4 | STM32_PUSHPULL_NOPULL)

#define STM32G4X_PINMUX_FUNC_PC8_PWM3_CH3 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PC8_PWM8_CH3 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_4 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PC8_I2C3_SCL                                      \
	(STM32_PINMUX_ALT_FUNC_8 | STM32_OPENDRAIN_PULLUP)

#define STM32G4X_PINMUX_FUNC_PC9_PWM3_CH4 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PC9_PWM8_CH4 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_4 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PC9_I2C3_SDA                                      \
	(STM32_PINMUX_ALT_FUNC_8 | STM32_OPENDRAIN_PULLUP)

#define STM32G4X_PINMUX_FUNC_PC10_UART4_TX __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_5 | STM32_PUSHPULL_PULLUP)
#define STM32G4X_PINMUX_FUNC_PC10_SPI3_SCK                                     \
	(STM32_PINMUX_ALT_FUNC_6 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PC10_USART3_TX __DEPRECATED_MACRO                                    \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUSHPULL_PULLUP)

#define STM32G4X_PINMUX_FUNC_PC11_UART4_RX __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_5 | STM32_PUPDR_NO_PULL)
#define STM32G4X_PINMUX_FUNC_PC11_SPI3_MISO                                    \
	(STM32_PINMUX_ALT_FUNC_6 | STM32_PUPDR_PULL_DOWN)
#define STM32G4X_PINMUX_FUNC_PC11_USART3_RX __DEPRECATED_MACRO                                    \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUPDR_NO_PULL)
#define STM32G4X_PINMUX_FUNC_PC11_I2C3_SDA                                     \
	(STM32_PINMUX_ALT_FUNC_8 | STM32_OPENDRAIN_PULLUP)

#define STM32G4X_PINMUX_FUNC_PC12_SPI3_MOSI                                    \
	(STM32_PINMUX_ALT_FUNC_6 | STM32_PUPDR_PULL_DOWN)

/* Port D */
#define STM32G4X_PINMUX_FUNC_PD0_FDCAN1_RX                                     \
	(STM32_PINMUX_ALT_FUNC_9 | STM32_PUSHPULL_NOPULL)

#define STM32G4X_PINMUX_FUNC_PD1_PWM8_CH4 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_4 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PD1_FDCAN1_TX                                     \
	(STM32_PINMUX_ALT_FUNC_9 | STM32_PUSHPULL_NOPULL)

#define STM32G4X_PINMUX_FUNC_PD3_PWM2_CH1 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PD3_USART2_CTS __DEPRECATED_MACRO                                    \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_OPENDRAIN_PULLUP)

#define STM32G4X_PINMUX_FUNC_PD4_PWM2_CH2 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PD4_USART2_RTS __DEPRECATED_MACRO                                    \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_OPENDRAIN_PULLUP)

#define STM32G4X_PINMUX_FUNC_PD5_USART2_TX __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUSHPULL_PULLUP)

#define STM32G4X_PINMUX_FUNC_PD6_PWM2_CH4 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PD6_USART2_RX __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUPDR_NO_PULL)

#define STM32G4X_PINMUX_FUNC_PD8_PWM2_CH3 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)

#define STM32G4X_PINMUX_FUNC_PD8_USART3_TX __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUSHPULL_PULLUP)

#define STM32G4X_PINMUX_FUNC_PD9_USART3_RX __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUPDR_NO_PULL)

#define STM32G4X_PINMUX_FUNC_PD11_USART3_CTS __DEPRECATED_MACRO                                   \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_OPENDRAIN_PULLUP)

#define STM32G4X_PINMUX_FUNC_PD12_USART3_RTS __DEPRECATED_MACRO                                   \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_OPENDRAIN_PULLUP)

#define STM32G4X_PINMUX_FUNC_PD15_SPI2_NSS                                     \
	(STM32_PINMUX_ALT_FUNC_6 | STM32_PUSHPULL_PULLUP)

/* Port E */
#define STM32G4X_PINMUX_FUNC_PE0_USART1_TX __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUSHPULL_PULLUP)

#define STM32G4X_PINMUX_FUNC_PE1_USART1_RX __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUPDR_NO_PULL)

#define STM32G4X_PINMUX_FUNC_PE2_PWM3_CH1 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)

