zephyrproject-rtos/zephyr/drivers/pinmux/stm32/pinmux_stm32g4x.h
#define STM32G4X_PINMUX_FUNC_PE3_PWM3_CH2 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)

#define STM32G4X_PINMUX_FUNC_PE4_PWM3_CH3 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)

#define STM32G4X_PINMUX_FUNC_PE5_PWM3_CH4 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)

#define STM32G4X_PINMUX_FUNC_PE9_PWM1_CH1 __DEPRECATED_MACRO                                      \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)

#define STM32G4X_PINMUX_FUNC_PE11_PWM1_CH2 __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)

#define STM32G4X_PINMUX_FUNC_PE13_PWM1_CH3 __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)

#define STM32G4X_PINMUX_FUNC_PE14_PWM1_CH4 __DEPRECATED_MACRO                                     \
	(STM32_PINMUX_ALT_FUNC_2 | STM32_PUSHPULL_NOPULL)

#define STM32G4X_PINMUX_FUNC_PE15_USART3_RX __DEPRECATED_MACRO                                    \
	(STM32_PINMUX_ALT_FUNC_7 | STM32_PUPDR_NO_PULL)

/* Port F */
#define STM32G4X_PINMUX_FUNC_PF0_I2C2_SDA                                      \
	(STM32_PINMUX_ALT_FUNC_4 | STM32_OPENDRAIN_PULLUP)
#define STM32G4X_PINMUX_FUNC_PF0_SPI2_NSS                                      \
	(STM32_PINMUX_ALT_FUNC_5 | STM32_PUSHPULL_PULLUP)
#define STM32G4X_PINMUX_FUNC_PF0_ADC1_IN10 STM32_MODER_ANALOG_MODE

#define STM32G4X_PINMUX_FUNC_PF1_SPI2_SCK                                      \
	(STM32_PINMUX_ALT_FUNC_5 | STM32_PUSHPULL_NOPULL)
#define STM32G4X_PINMUX_FUNC_PF1_ADC2_IN10 STM32_MODER_ANALOG_MODE

#endif /* ZEPHYR_DRIVERS_PINMUX_STM32_PINMUX_STM32G4X_H_ */
